In [1]:
## Handling imbalanced Dataset

In [44]:
import pandas as pd
import numpy as np

In [45]:
n_0=np.random.normal(loc=0,scale=1,size=900)
n_1=np.random.normal(loc=0,scale=1,size=900)

class_0=pd.DataFrame({'f_1':n_0,'f_2':n_1})


class_0['target']=0
print(class_0.head())

        f_1       f_2  target
0 -1.549368  0.244332       0
1 -0.930212  0.718444       0
2 -0.528082 -0.889247       0
3  0.670307  0.111621       0
4  0.125515 -0.885061       0

In [46]:
import numpy as np
import pandas as pd

n_0 = np.random.normal(scale=1, loc=1, size=100)
n_1 = np.random.normal(scale=1, loc=1, size=100)

class_1 = pd.DataFrame({'f_1': n_0, 'f_2': n_1})
class_1['target']=1
print(class_1)

         f_1       f_2  target
0   1.950836 -0.194628       1
1  -0.419639  3.134680       1
2   1.473377  0.916865       1
3   1.690031  1.105427       1
4   2.304616  0.733969       1
..       ...       ...     ...
95  0.498192  0.661857       1
96  1.136525  0.420885       1
97 -0.157513  1.336887       1
98 -0.111329  0.736990       1
99  0.533576  1.517877       1

[100 rows x 3 columns]

In [49]:
df=pd.concat([class_0,class_1])
df.tail()

         f_1       f_2  target
95  0.498192  0.661857       1
96  1.136525  0.420885       1
97 -0.157513  1.336887       1
98 -0.111329  0.736990       1
99  0.533576  1.517877       1

In [53]:

from sklearn.utils import resample

majority = df[df['target'] == 0]
minority = df[df['target'] == 1]

minority

         f_1       f_2  target
0   1.950836 -0.194628       1
1  -0.419639  3.134680       1
2   1.473377  0.916865       1
3   1.690031  1.105427       1
4   2.304616  0.733969       1
..       ...       ...     ...
95  0.498192  0.661857       1
96  1.136525  0.420885       1
97 -0.157513  1.336887       1
98 -0.111329  0.736990       1
99  0.533576  1.517877       1

[100 rows x 3 columns]

In [35]:
!pip install scikit-learn

Collecting scikit-learn
  Downloading scikit_learn-1.7.2-cp313-cp313-macosx_12_0_arm64.whl.metadata (11 kB)
Requirement already satisfied: numpy>=1.22.0 in ./path/to/venv/lib/python3.13/site-packages (from scikit-learn) (2.3.5)
Collecting scipy>=1.8.0 (from scikit-learn)
  Downloading scipy-1.16.3-cp313-cp313-macosx_14_0_arm64.whl.metadata (62 kB)
Collecting joblib>=1.2.0 (from scikit-learn)
  Downloading joblib-1.5.2-py3-none-any.whl.metadata (5.6 kB)
Collecting threadpoolctl>=3.1.0 (from scikit-learn)
  Downloading threadpoolctl-3.6.0-py3-none-any.whl.metadata (13 kB)
Downloading scikit_learn-1.7.2-cp313-cp313-macosx_12_0_arm64.whl (8.6 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 8.6/8.6 MB 969.0 kB/s eta 0:00:000:00:01
Downloading joblib-1.5.2-py3-none-any.whl (308 kB)
Downloading scipy-1.16.3-cp313-cp313-macosx_14_0_arm64.whl (20.9 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 20.9/20.9 MB 1.0 MB/s eta 0:00:0000:0100:010m
Downloading threadpoolctl-3.6.0-py3-none-any.whl (18 kB)
Installing collected packages: threadpoolctl, scipy, joblib, scikit-learn
Successfully installed joblib-1.5.2 scikit-learn-1.7.2 scipy-1.16.3 threadpoolctl-3.6.0

[notice] A new release of pip is available: 25.0 -> 25.3
[notice] To update, run: pip install --upgrade pip

In [55]:
#Upsampling
upsampled=resample(minority,n_samples=len(majority),random_state=42,replace=True)
upsampled

         f_1       f_2  target
51  1.320924  1.955733       1
92 -0.394770  0.539235       1
14  1.347159 -0.504509       1
71 -0.454021  1.561710       1
60  1.070440  0.529541       1
..       ...       ...     ...
52  1.614322  1.635605       1
65 -0.406318  2.439595       1
76  1.334393  1.300978       1
42  1.756393  2.314457       1
74  2.084288  2.552571       1

[900 rows x 3 columns]

In [60]:
#Downsampling

down_sampled=resample(majority,n_samples=len(minority),replace=False,random_state=42)
down_sampled.reset_index().drop(columns=['index'],axis=1)

         f_1       f_2  target
0  -0.391369  0.909029       0
1  -0.619724  0.506359       0
2  -0.278221 -0.579027       0
3   0.326794  1.044798       0
4  -0.198078 -0.392873       0
..       ...       ...     ...
95 -0.045352  0.511001       0
96  0.449368  0.371721       0
97  1.998538 -1.401314       0
98  0.158345 -1.083844       0
99 -0.207612 -1.362896       0

[100 rows x 3 columns]

In [68]:
#SMOTE
from sklearn.datasets import make_classification

X,y=make_classification(n_samples=1000,n_redundant=0,n_features=2,n_clusters_per_class=1,
                   weights=[0.90],random_state=12)

In [69]:
import pandas as pd
df1=pd.DataFrame(X,columns=['f1','f2'])
df2=pd.DataFrame(y,columns=['target'])
final_df=pd.concat([df1,df2],axis=1)
final_df.head()

         f1        f2  target
0 -0.762898 -0.706808       0
1 -1.075436 -1.051162       0
2 -0.610115 -0.909802       0
3 -2.023284 -0.428945       1
4 -0.812921 -1.316206       0

In [75]:
!pip install seaborn

Collecting seaborn
  Using cached seaborn-0.13.2-py3-none-any.whl.metadata (5.4 kB)
Requirement already satisfied: numpy!=1.24.0,>=1.20 in ./path/to/venv/lib/python3.13/site-packages (from seaborn) (2.3.5)
Requirement already satisfied: pandas>=1.2 in ./path/to/venv/lib/python3.13/site-packages (from seaborn) (2.3.3)
Collecting matplotlib!=3.6.1,>=3.4 (from seaborn)
  Downloading matplotlib-3.10.7-cp313-cp313-macosx_11_0_arm64.whl.metadata (11 kB)
Collecting contourpy>=1.0.1 (from matplotlib!=3.6.1,>=3.4->seaborn)
  Downloading contourpy-1.3.3-cp313-cp313-macosx_11_0_arm64.whl.metadata (5.5 kB)
Collecting cycler>=0.10 (from matplotlib!=3.6.1,>=3.4->seaborn)
  Using cached cycler-0.12.1-py3-none-any.whl.metadata (3.8 kB)
Collecting fonttools>=4.22.0 (from matplotlib!=3.6.1,>=3.4->seaborn)
  Downloading fonttools-4.61.0-cp313-cp313-macosx_10_13_universal2.whl.metadata (113 kB)
Collecting kiwisolver>=1.3.1 (from matplotlib!=3.6.1,>=3.4->seaborn)
  Downloading kiwisolver-1.4.9-cp313-cp313-macosx_11_0_arm64.whl.metadata (6.3 kB)
Requirement already satisfied: packaging>=20.0 in ./path/to/venv/lib/python3.13/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (25.0)
Collecting pillow>=8 (from matplotlib!=3.6.1,>=3.4->seaborn)
  Using cached pillow-12.0.0-cp313-cp313-macosx_11_0_arm64.whl.metadata (8.8 kB)
Collecting pyparsing>=3 (from matplotlib!=3.6.1,>=3.4->seaborn)
  Downloading pyparsing-3.2.5-py3-none-any.whl.metadata (5.0 kB)
Requirement already satisfied: python-dateutil>=2.7 in ./path/to/venv/lib/python3.13/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in ./path/to/venv/lib/python3.13/site-packages (from pandas>=1.2->seaborn) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in ./path/to/venv/lib/python3.13/site-packages (from pandas>=1.2->seaborn) (2025.2)
Requirement already satisfied: six>=1.5 in ./path/to/venv/lib/python3.13/site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.4->seaborn) (1.17.0)
Using cached seaborn-0.13.2-py3-none-any.whl (294 kB)
Downloading matplotlib-3.10.7-cp313-cp313-macosx_11_0_arm64.whl (8.1 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 8.1/8.1 MB 2.3 MB/s eta 0:00:00a 0:00:01
Downloading contourpy-1.3.3-cp313-cp313-macosx_11_0_arm64.whl (274 kB)
Using cached cycler-0.12.1-py3-none-any.whl (8.3 kB)
Downloading fonttools-4.61.0-cp313-cp313-macosx_10_13_universal2.whl (2.8 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 2.8/2.8 MB 2.1 MB/s eta 0:00:00a 0:00:01
Downloading kiwisolver-1.4.9-cp313-cp313-macosx_11_0_arm64.whl (64 kB)
Using cached pillow-12.0.0-cp313-cp313-macosx_11_0_arm64.whl (4.7 MB)
Downloading pyparsing-3.2.5-py3-none-any.whl (113 kB)
Installing collected packages: pyparsing, pillow, kiwisolver, fonttools, cycler, contourpy, matplotlib, seaborn
Successfully installed contourpy-1.3.3 cycler-0.12.1 fonttools-4.61.0 kiwisolver-1.4.9 matplotlib-3.10.7 pillow-12.0.0 pyparsing-3.2.5 seaborn-0.13.2

[notice] A new release of pip is available: 25.0 -> 25.3
[notice] To update, run: pip install --upgrade pip

In [71]:
from imblearn.over_sampling import SMOTE


oversample=SMOTE()

X,y=oversample.fit_resample(final_df[['f1','f2']],final_df['target'])

In [74]:
df1=pd.DataFrame(X,columns=['f1','f2'])
df2=pd.DataFrame(y,columns=['target'])
oversample_df=pd.concat([df1,df2],axis=1)

oversample_df['target'].value_counts()

target
0    900
1    900
Name: count, dtype: int64

# Encoding

# OneHotEncoding

In [79]:
import seaborn as sns

df=sns.load_dataset('tips')
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [87]:
smoker=len(df[df['smoker']=='Yes'])
smoker

93

In [94]:
from sklearn.preprocessing import OneHotEncoder
oh= OneHotEncoder()

smoker_num=oh.fit_transform(df[['smoker']]).toarray()

In [97]:
import pandas as pd
encoder_df=pd.DataFrame(smoker_num,columns=oh.get_feature_names_out())
encoder_df

     smoker_No  smoker_Yes
0          1.0         0.0
1          1.0         0.0
2          1.0         0.0
3          1.0         0.0
4          1.0         0.0
..         ...         ...
239        1.0         0.0
240        0.0         1.0
241        0.0         1.0
242        1.0         0.0
243        1.0         0.0

[244 rows x 2 columns]

In [108]:
smoke_num=pd.concat([df,encoder_df],axis=1)
smoke_num.drop(columns=['smoker'],inplace=True)
smoke_num

     total_bill   tip     sex   day    time  size  smoker_No  smoker_Yes
0         16.99  1.01  Female   Sun  Dinner     2        1.0         0.0
1         10.34  1.66    Male   Sun  Dinner     3        1.0         0.0
2         21.01  3.50    Male   Sun  Dinner     3        1.0         0.0
3         23.68  3.31    Male   Sun  Dinner     2        1.0         0.0
4         24.59  3.61  Female   Sun  Dinner     4        1.0         0.0
..          ...   ...     ...   ...     ...   ...        ...         ...
239       29.03  5.92    Male   Sat  Dinner     3        1.0         0.0
240       27.18  2.00  Female   Sat  Dinner     2        0.0         1.0
241       22.67  2.00    Male   Sat  Dinner     2        0.0         1.0
242       17.82  1.75    Male   Sat  Dinner     2        1.0         0.0
243       18.78  3.00  Female  Thur  Dinner     2        1.0         0.0

[244 rows x 8 columns]

In [113]:
len(smoke_num[smoke_num['smoker_No']==1])

151

# Label Encoding

In [ ]:
smoke_num['day'].value_counts()

day
Sat     87
Sun     76
Thur    62
Fri     19
Name: count, dtype: int64

In [131]:
from sklearn.preprocessing import LabelEncoder

le=LabelEncoder()
days=le.fit_transform(smoke_num[['day']])
day_num=pd.DataFrame(days,columns=['day_num'])
final=pd.concat([smoke_num,day_num],axis=1)
final.drop(columns=['day'],inplace=True)
final

/Users/abhiram/Documents/Data Science/path/to/venv/lib/python3.13/site-packages/sklearn/preprocessing/_label.py:110: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

     total_bill   tip     sex    time  size  smoker_No  smoker_Yes  day_num
0         16.99  1.01  Female  Dinner     2        1.0         0.0        2
1         10.34  1.66    Male  Dinner     3        1.0         0.0        2
2         21.01  3.50    Male  Dinner     3        1.0         0.0        2
3         23.68  3.31    Male  Dinner     2        1.0         0.0        2
4         24.59  3.61  Female  Dinner     4        1.0         0.0        2
..          ...   ...     ...     ...   ...        ...         ...      ...
239       29.03  5.92    Male  Dinner     3        1.0         0.0        1
240       27.18  2.00  Female  Dinner     2        0.0         1.0        1
241       22.67  2.00    Male  Dinner     2        0.0         1.0        1
242       17.82  1.75    Male  Dinner     2        1.0         0.0        1
243       18.78  3.00  Female  Dinner     2        1.0         0.0        3

[244 rows x 8 columns]

In [132]:
final['sex'].value_counts()

sex
Male      157
Female     87
Name: count, dtype: int64

In [138]:
gender_le=LabelEncoder()
genders=gender_le.fit_transform(final['sex'])

sex_df=pd.DataFrame(genders,columns=['sex_df'])
sex_df

     sex_df
0         0
1         1
2         1
3         1
4         0
..      ...
239       1
240       0
241       1
242       1
243       0

[244 rows x 1 columns]

In [142]:
final=pd.concat([final.drop(columns='sex'),sex_df],axis=1)

In [145]:
final['time'].value_counts()
final

     total_bill   tip    time  size  smoker_No  smoker_Yes  day_num  sex_df
0         16.99  1.01  Dinner     2        1.0         0.0        2       0
1         10.34  1.66  Dinner     3        1.0         0.0        2       1
2         21.01  3.50  Dinner     3        1.0         0.0        2       1
3         23.68  3.31  Dinner     2        1.0         0.0        2       1
4         24.59  3.61  Dinner     4        1.0         0.0        2       0
..          ...   ...     ...   ...        ...         ...      ...     ...
239       29.03  5.92  Dinner     3        1.0         0.0        1       1
240       27.18  2.00  Dinner     2        0.0         1.0        1       0
241       22.67  2.00  Dinner     2        0.0         1.0        1       1
242       17.82  1.75  Dinner     2        1.0         0.0        1       1
243       18.78  3.00  Dinner     2        1.0         0.0        3       0

[244 rows x 8 columns]

# Target Guided Ordinal Encoding

In [147]:
final['time'].value_counts()

time
Dinner    176
Lunch      68
Name: count, dtype: int64

In [161]:
a = final.groupby('time')['total_bill'].mean()
a

/var/folders/fk/k7khz2tn63sdqb5dw30ysb0h0000gn/T/ipykernel_9307/3495368172.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  a = final.groupby('time')['total_bill'].mean()

time
Lunch     17.168676
Dinner    20.797159
Name: total_bill, dtype: float64

In [166]:
final['time_encoded']=final['time'].map(a)
final

,total_bill,tip,time,size,smoker_No,smoker_Yes,day_num,sex_df,time_encoded
0,16.99,1.01,Dinner,2,1.0,0.0,2,0,20.797159
1,10.34,1.66,Dinner,3,1.0,0.0,2,1,20.797159
2,21.01,3.50,Dinner,3,1.0,0.0,2,1,20.797159
3,23.68,3.31,Dinner,2,1.0,0.0,2,1,20.797159
4,24.59,3.61,Dinner,4,1.0,0.0,2,0,20.797159
...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Dinner,3,1.0,0.0,1,1,20.797159
240,27.18,2.00,Dinner,2,0.0,1.0,1,0,20.797159
241,22.67,2.00,Dinner,2,0.0,1.0,1,1,20.797159
242,17.82,1.75,Dinner,2,1.0,0.0,1,1,20.797159
243,18.78,3.00,Dinner,2,1.0,0.0,3,0,20.797159

In [167]:
final.drop(columns=['time'])

,total_bill,tip,size,smoker_No,smoker_Yes,day_num,sex_df,time_encoded
0,16.99,1.01,2,1.0,0.0,2,0,20.797159
1,10.34,1.66,3,1.0,0.0,2,1,20.797159
2,21.01,3.50,3,1.0,0.0,2,1,20.797159
3,23.68,3.31,2,1.0,0.0,2,1,20.797159
4,24.59,3.61,4,1.0,0.0,2,0,20.797159
...,...,...,...,...,...,...,...,...
239,29.03,5.92,3,1.0,0.0,1,1,20.797159
240,27.18,2.00,2,0.0,1.0,1,0,20.797159
241,22.67,2.00,2,0.0,1.0,1,1,20.797159
242,17.82,1.75,2,1.0,0.0,1,1,20.797159
243,18.78,3.00,2,1.0,0.0,3,0,20.797159

# Ordinal Encoding

In [168]:
import pandas as pd

data = {
    "Person_ID": range(1, 11),
    "Education_Level": [
        "High School", "Bachelor", "Master", "Bachelor", "PhD",
        "Master", "High School", "PhD", "Bachelor", "Master"
    ],
    "Years_Experience": [1, 3, 5, 2, 10, 6, 0, 12, 4, 7],
    "Salary": [30000, 45000, 60000, 40000, 90000, 65000, 28000, 120000, 50000, 70000]
}

df = pd.DataFrame(data)
df

   Person_ID Education_Level  Years_Experience  Salary
0          1     High School                 1   30000
1          2        Bachelor                 3   45000
2          3          Master                 5   60000
3          4        Bachelor                 2   40000
4          5             PhD                10   90000
5          6          Master                 6   65000
6          7     High School                 0   28000
7          8             PhD                12  120000
8          9        Bachelor                 4   50000
9         10          Master                 7   70000

In [169]:
df['Education_Level'].value_counts()

Education_Level
Bachelor       3
Master         3
High School    2
PhD            2
Name: count, dtype: int64

In [176]:
from sklearn.preprocessing import OrdinalEncoder

oe = OrdinalEncoder()
abc=oe.fit_transform(df[['Education_Level']],['High School','Bachelor','Master','PhD'])


df['Education_Level_Encoded']=pd.DataFrame(abc)

df.drop(columns=['Education_Level'])

   Person_ID  Years_Experience  Salary  Education_Level_Encoded
0          1                 1   30000                      1.0
1          2                 3   45000                      0.0
2          3                 5   60000                      2.0
3          4                 2   40000                      0.0
4          5                10   90000                      3.0
5          6                 6   65000                      2.0
6          7                 0   28000                      1.0
7          8                12  120000                      3.0
8          9                 4   50000                      0.0
9         10                 7   70000                      2.0